Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: Distribution of source code, as most free licenses dictate, protects the users by allowing them to customize the software and adjust it to their needs.
pt_pt: A distribuição do código-fonte, como definida na maioria das licenças livres, protege os(as) usuários(as) permitindo-lhes personalizar o software e ajustá-lo às suas necessidades.

source: · Any work that includes part of the authors' work (also called "derived works" in copyright discussions) must use the same license.
pt_pt: · Qualquer trabalho que inclua parte do trabalho do(a) autor(a) (também chamado de "trabalhos derivados" na discussão de direitos autorais) deve usar a mesma licença.

source: Three of the most widely used free software licenses are the GNU General Public License (GPL), the Artistic License, and the BSD Style License.
pt_pt: Três das licenças de software livre mais amplamente utilizadas são a Licença Pública Geral GNU (GPL - GNU General Public), a Licença artística (Artistic License), e a Licença estilo BSD (BSD Style License).

source: How to choose a License?
pt_pt: Como escolher uma licença?

source: Sometimes people write their own licenses, which can be problematic, so this is frowned upon in the free software community.
pt_pt: Às vezes, as pessoas escrevem suas próprias licenças, o que pode ser problemático, então isso é desaprovado na comunidade de software livre.

source: Too often, the wording is either ambiguous, or people create conditions that conflict with each other.
pt_pt: Muitas vezes o texto é ambíguo ou as pessoas criam condições que entram em conflito umas com as outras.

source: Writing a license which holds up in court is even harder.
pt_pt: Escrever uma licença válida em um tribunal é ainda mais difícil.

source: Luckily, there are a number of Open Source licenses available to choose from.
pt_pt: Felizmente, existem várias licenças de código aberto disponíveis para você escolher.

source: They have the following things in common:
pt_pt: Elas têm as seguintes coisas em comum:

source: · Users may install the software on as many machines as they want.
pt_pt: · Usuários(as) podem instalar o software em quantas máquinas quiserem.

source: · Any number of people may use the software at one time.
pt_pt: · Qualquer número de pessoas pode usar o software ao mesmo tempo.

source: · Users may make as many copies of the software as they want or need and also give these copies to other users (free or open redistribution).
pt_pt: · Usuários(as) podem fazer quantas cópias do software desejarem ou precisarem, e também podem dar essas cópias para outros(as) usuários(as) (redistribuição livre ou aberta).

source: · There are no restrictions on modifying the software (except for keeping certain credits).
pt_pt: · Não há restrições para modificação do software (exceto que se deve manter certos créditos).

source: · Users may not only distribute the software, they may even sell it.
pt_pt: · Usuários(as) podem não apenas distribuir o software, como podem até mesmo vendê-lo.

source: Especially the last point, which allows people to sell the software, seems to go against the whole idea of free software, but it's actually one of its strengths.
pt_pt: Especialmente o último ponto, que permite que as pessoas vendam o software, parece ir contra toda a ideia do software livre, mas na verdade é um de seus pontos fortes.

source: Since the license allows for free redistribution, once somebody gets a copy he or she can distribute it as well.
pt_pt: Uma vez que a licença permite a redistribuição gratuita, uma vez que alguém obtém uma cópia, ele(a) pode distribuí-la também.

source: People can even try to sell it.
pt_pt: As pessoas podem até tentar vendê-lo.

source: While free software is not completely free of constraints, it gives users the flexibility to do what they need in order to get a job done.
pt_pt: Embora o software livre não seja totalmente livre de restrições, oferece aos(as) usuários(as) flexibilidade para fazer o que eles(as) precisam para realizar seu trabalho.

source: At the same time, authors' rights are protected – now, that's freedom.
pt_pt: Ao mesmo tempo, protege os direitos do(a) autor(a) – isso sim é liberdade.

source: The Debian project and its members are strong supporters of free software. We've compiled the Debian Free Software Guidelines (DFSG) to come up with a reasonable definition of what constitutes free software in our opinion.
pt_pt: Compilamos a Definição Debian de Software Livre (DFSG - Debian Free Software Guidelines) para chegarmos a uma definição razoável do que constitui software livre em nossa opinião.

source: Only software that complies with the DFSG is allowed in the main Debian distribution.
pt_pt: Somente software que está em conformidade com a DFSG é permitido no repositório principal (main) do Debian.

source: Български (Bəlgarski) català česky dansk Deutsch Ελληνικά (Ellinika) español فارسی (Farsi) français Galego hrvatski Italiano 한국어 (Korean) magyar Nederlands 日本語 (Nihongo) norsk (bokmål) polski Português română Русский (Russkij) slovenčina suomi svenska Tiếng Việt Türkçe українська (ukrajins'ka) 中文(简) 中文(HK) 中文(繁)
pt_pt: Български (Bəlgarski) català česky dansk Deutsch Ελληνικά (Ellinika) English español فارسی (Farsi) français Galego hrvatski Italiano 한국어 (Korean) magyar Nederlands 日本語 (Nihongo) norsk (bokmål) polski română Русский (Russkij) slovenčina suomi svenska Tiếng Việt Türkçe українська (ukrajins'ka) 中文(简) 中文(HK) 中文(繁)

source: See our contact page to get in touch.
pt_pt: Veja nossa página de contato para falar conosco.

source: Web site source code is available.
pt_pt: O código-fonte do site web está disponível.

source: Last Modified: Thu, Feb 22 06:32:50 UTC 2024 Last Built: Tue, Aug 6 19:47:25 UTC 2024
pt_pt: Última Modificação: Qui, 22 de Fev de 2024, 09:06:11 UTC Última compilação: Ter, 6 de Ago de 2024, 22:07:06 UTC

source: Copyright © 1997-2024 SPI and others; See license terms
pt_pt: Copyright © 1997-2024 SPI e outros; Veja os termos de licença

source: Debian Releases
pt_pt: Versões/Lançamentos Debian

source: Debian always has at least three releases in active maintenance: stable, testing and unstable.
pt_pt: O Debian sempre tem pelo menos três versões em manutenção ativa: estável (stable), teste (testing) e instável (unstable).

source: stable
pt_pt: estável (stable)

source: The stable distribution contains the latest officially released distribution of Debian.
pt_pt: A versão estável (stable) contém a última versão oficialmente lançada do Debian.

source: This is the production release of Debian, the one which we primarily recommend using.
pt_pt: Esta é a versão de produção do Debian, a que nós primeiramente recomendamos que seja usada.

source: The current stable distribution of Debian is version 12, codenamed bookworm.
pt_pt: A atual versão estável (stable) do Debian é a versão 12, codinome bookworm.

source: It was initially released as version 12.0 on June 10th, 2023 and its latest update, version 12.6, was released on June 29th, 2024.
pt_pt: Ela foi inicialmente lançada como versão 12.0 em 10 de Junho de 2023 e sua última atualização, versão 12.6, foi lançada em 29 de Junho de 2024.

source: testing
pt_pt: teste (testing)

source: The testing distribution contains packages that haven't been accepted into a stable release yet, but they are in the queue for that.
pt_pt: A versão teste (testing) contém pacotes que ainda não foram aceitos na versão estável (stable), mas estão na fila para tanto.

source: The main advantage of using this distribution is that it has more recent versions of software.
pt_pt: A principal vantagem de usar esta versão é que ela possui versões mais recentes de software.

source: See the Debian FAQ for more information on what is testing and how it becomes stable.
pt_pt: Veja a FAQ do Debian para mais informações sobre o que é testing e como ela se torna estável (stable).

source: The current testing distribution is trixie.
pt_pt: A atual versão teste (testing) é trixie.

source: unstable
pt_pt: instável (unstable)

source: The unstable distribution is where active development of Debian occurs.
pt_pt: A versão instável (unstable) é onde o desenvolvimento ativo do Debian ocorre.

source: Generally, this distribution is run by developers and those who like to live on the edge.
pt_pt: Geralmente, esta versão é utilizada por desenvolvedores(as) e por aqueles(as) que gostam de viver no limite.

source: It is recommended that users running unstable should subscribe to the debian-devel-announce mailing list to receive notifications of major changes, for example upgrades that may break.
pt_pt: Recomenda-se aos(as) usuários(as) que utilizam a versão instável (unstable) que se inscrevam na lista de discussão debian-devel-announce para receberem as notificações das maiores mudanças, por exemplo, atualizações que podem quebrar.

source: The unstable distribution is always called sid.
pt_pt: A versão instável (unstable) é sempre chamada de sid.

source: Release life cycle
pt_pt: Ciclo de vida dos lançamentos

source: Debian announces its new stable release on a regular basis.
pt_pt: O Debian anuncia seu novo lançamento estável (stable) regularmente.

source: The Debian release life cycle encompasses five years: the first three years of full support followed by two years of Long Term Support (LTS).
pt_pt: O ciclo de vida do lançamento do Debian abrange cinco anos: os primeiros três anos de suporte total, seguidos por dois anos de Suporte de Longo Prazo (LTS Long Term Support).

source: See Debian Releases Wiki page and Debian LTS Wiki page for detailed information.
pt_pt: Veja a página da wiki Lançamentos Debian e a página da wiki Debian LTS para informações detalhadas.

source: Index of releases
pt_pt: Índice dos lançamentos

source: · The next release of Debian is codenamed trixie — testing — no release date has been set
pt_pt: · A próxima versão do Debian tem o codinome trixie — teste (testing), — nenhuma data de lançamento foi definida

source: · Debian 12 (bookworm) — current stable release
pt_pt: · Debian 12 (bookworm) — versão estável (stable) atual

source: · Debian 11 (bullseye) — current oldstable release
pt_pt: · Debian 11 (bullseye) — versão estável antiga (oldstable) atual

source: · Debian 10 (buster) — archived release, under third-party paid extended LTS support
pt_pt: · Debian 10 (buster) — versão arquivada, sob suporte LTS estendido pago por terceiros

source: · Debian 9 (stretch) — archived release, under third-party paid extended LTS support
pt_pt: · Debian 9 (stretch) — versão arquivada, sob suporte LTS estendido pago por terceiros

source: · Debian 8 (jessie) — archived release, under third-party paid extended LTS support
pt_pt: · Debian 8 (jessie) — versão arquivada, sob suporte LTS estendido pago por terceiros

source: · Debian 7 (wheezy) — obsolete stable release
pt_pt: · Debian 7 (wheezy) — versão estável obsoleta

source: · Debian 6.0 (squeeze) — obsolete stable release
pt_pt: · Debian 6.0 (squeeze) — versão estável obsoleta

source: · Debian GNU/Linux 5.0 (lenny) — obsolete stable release
pt_pt: · Debian GNU/Linux 5.0 (lenny) — versão estável obsoleta

source: · Debian GNU/Linux 4.0 (etch) — obsolete stable release
pt_pt: · Debian GNU/Linux 4.0 (etch) — versão estável obsoleta

source: · Debian GNU/Linux 3.1 (sarge) — obsolete stable release
pt_pt: · Debian GNU/Linux 3.1 (sarge) — versão estável obsoleta

source: · Debian GNU/Linux 3.0 (woody) — obsolete stable release
pt_pt: · Debian GNU/Linux 3.0 (woody) — versão estável obsoleta

source: · Debian GNU/Linux 2.2 (potato) — obsolete stable release
pt_pt: · Debian GNU/Linux 2.2 (potato) — versão estável obsoleta

source: · Debian GNU/Linux 2.1 (slink) — obsolete stable release
pt_pt: · Debian GNU/Linux 2.1 (slink) — versão estável obsoleta

source: · Debian GNU/Linux 2.0 (hamm) — obsolete stable release
pt_pt: · Debian GNU/Linux 2.0 (hamm) — versão estável obsoleta

source: The web pages for the obsolete Debian releases are kept intact, but the releases themselves can only be found in a separate archive.
pt_pt: As páginas web para as versões obsoletas do Debian são mantidas intactas, mas as versões propriamente ditas só podem ser encontradas em um repositório separado.

source: See the Debian FAQ for an explanation of where all these codenames came from.
pt_pt: Veja a FAQ do Debian para uma explicação de onde todos estes codinomes vêm.

source: Integrity of the data in the releases
pt_pt: Integridade dos dados nas versões

source: Data integrity is granted by a digitally signed Release file.
pt_pt: A integridade dos dados é garantida por um arquivo Release assinado digitalmente.

source: To ensure that all files in the release belong to it, checksums of all Packages files are copied into the Release file.
pt_pt: Para garantir que todos os arquivos de uma versão pertençam a ela, os checksums de todos os arquivos Packages estão copiados dentro do arquivo Release.

source: Digital signatures for this file are stored in the file Release.gpg, using the current version of the archive signing key.
pt_pt: Assinaturas digitais para este arquivo são armazenadas no arquivo Release.gpg, usando a versão atual da chave de assinatura do repositório.

source: For stable and oldstable an additional signature is generated using an offline key specifically generated for a release by a member of the Stable Release Team.
pt_pt: Para a estável (stable) e estável antiga (oldstable) uma assinatura adicional é gerada usando uma chave off-line especificamente gerada para uma versão por um(a) membro(a) da equipe da versão estável (stable).

source: عربية (Arabiya) Български (Bəlgarski) català česky dansk Deutsch Ελληνικά (Ellinika) español فارسی (Farsi) français Galego hrvatski Indonesia Italiano 한국어 (Korean) magyar Nederlands 日本語 (Nihongo) norsk (bokmål) polski Português română Русский (Russkij) slovenčina suomi svenska Tiếng Việt Türkçe українська (ukrajins'ka) 中文(简) 中文(HK) 中文(繁)
pt_pt: عربية (Arabiya) Български (Bəlgarski) català česky dansk Deutsch Ελληνικά (Ellinika) English español فارسی (Farsi) français Galego hrvatski Indonesia Italiano 한국어 (Korean) magyar Nederlands 日本語 (Nihongo) norsk (bokmål) polski română Русский (Russkij) slovenčina suomi svenska Tiếng Việt Türkçe українська (ukrajins'ka) 中文(简) 中文(HK) 中文(繁)

source: Last Modified: Tue, Jul 2 19:24:13 UTC 2024 Last Built: Tue, Aug 6 19:48:53 UTC 2024
pt_pt: Última Modificação: Sáb, 13 de Jul de 2024, 15:24:14 UTC Última compilação: Ter, 6 de Ago de 2024, 22:08:14 UTC

source: Introduction to Debian
pt_pt: Introdução ao Debian

source: Debian is a Community
pt_pt: O Debian é uma comunidade

source: Thousands of volunteers around the world work together on the Debian operating system, prioritizing Free and Open Source Software. Meet the Debian project.
pt_pt: Milhares de voluntários(as) ao redor do mundo trabalham juntos(as) no sistema operacional Debian, priorizando o Software Livre e de Código Aberto. Conheça o projeto Debian.

source: · People: Who we are and what we do
pt_pt: · As pessoas: Quem somos e o que fazemos

source: · Our Philosophy: Why we do it and how we do it
pt_pt: · Nossa filosofia: Por que fazemos e como fazemos

source: · Get involved: How to become a Debian contributor
pt_pt: · Envolva-se: Como se tornar um(a) contribuidor(a) Debian

source: · Contribute: How you can help Debian
pt_pt: · Contribuir: Como você pode ajudar o Debian

source: · Debian Social Contract: Our moral agenda
pt_pt: · Contrato social Debian: Nosso compromisso ético

source: · Everyone is welcome: Debian's Diversity Statement
pt_pt: · Todos(as) são bem-vindos(as) Declaração de diversidade

source: · For Participants: Debian's Code of conduct
pt_pt: · Para participantes Código de conduta Debian

source: · Partners: Companies and organizations assisting the Debian project
pt_pt: · Parceiros(as): Empresas e organizações que auxiliam o projeto Debian

source: · Donations: How to sponsor the Debian project
pt_pt: · Doações Como patrocinar o projeto Debian

source: · Legal Issues: Licenses, trademarks, privacy policy, patent policy, etc.
pt_pt: · Questões legais Licenças, marcas registradas, política de privacidade, política de patentes, etc.

source: · Contact: How to get in touch with us
pt_pt: · Contato Como entrar em contato conosco

source: Debian is an Operating System
pt_pt: O Debian é um sistema operacional livre

source: Debian is a free operating system, developed and maintained by the Debian project. A free Linux distribution with thousands of applications to meet our users' needs.
pt_pt: O Debian é um sistema operacional livre, desenvolvido e mantido pelo projeto Debian. Uma distribuição Linux livre com milhares de aplicativos para atender às necessidades de nossos(as) usuários(as).

source: · Download: Where to get Debian
pt_pt: · Download: Onde obter o Debian

source: · Why Debian: Reasons to choose Debian
pt_pt: · Por que Debian Razões para escolher o Debian

source: · Support: Where to find help
pt_pt: · Suporte: Onde encontrar ajuda

source: · Security: Recent advisories and sources of security information
pt_pt: · Segurança: Avisos recentes e fontes de informações de segurança

source: · Software: Search and browse the long list of Debian packages
pt_pt: · Software: Pesquise e navegue pela longa lista dos pacotes Debian

source: · Documentation: Installation guide, FAQ, HOWTOs, Wiki, and more
pt_pt: · Documentação Guia de instalação, FAQ, HOWTOs, Wiki, e mais

source: · Bug Tracking System (BTS): How to report a bug, BTS documentation
pt_pt: · Sistema de rastreamenteo de bugs (BTS - Bug Tracking System) Como relatar um bug, documentação do BTS

source: · Mailing Lists: Collection of Debian lists for users, developers, etc.
pt_pt: · Listas de discussão: Coleção de listas do Debian para usuários(as), desenvolvedores(as), etc. Listas em português

source: · Pure Blends: Meta packages for specific needs
pt_pt: · Pure Blends: Metapacotes para necessidades específicas

source: · Developers' Corner: Information primarily of interest to Debian developers
pt_pt: · Canto dos(as) desenvolvedores(as): Informações principalmente de interesse de desenvolvedores(as) Debian

source: · Ports/Architectures: Debian support for various CPU architectures
pt_pt: · Portes/Arquiteturas: Suporte Debian para várias arquiteturas de CPU

source: · Search: Information on how to use the Debian search engine
pt_pt: · Pesquisa: Informações como sobre como usar o mecanismo de busca Debian

source: · Languages: Language settings for the Debian website
pt_pt: · Idiomas: Configuração de idioma para o site web do Debian

source: عربية (Arabiya) Български (Bəlgarski) dansk Deutsch Ελληνικά (Ellinika) español فارسی (Farsi) français Italiano 한국어 (Korean) magyar Nederlands norsk (bokmål) polski Português Русский (Russkij) svenska Tiếng Việt 中文(简) 中文(HK) 中文(繁)
pt_pt: عربية (Arabiya) Български (Bəlgarski) dansk Deutsch Ελληνικά (Ellinika) English español فارسی (Farsi) français Italiano 한국어 (Korean) magyar Nederlands norsk (bokmål) polski Русский (Russkij) svenska Tiếng Việt 中文(简) 中文(HK) 中文(繁)

source: Last Modified: Sun, Mar 24 11:18:05 UTC 2024 Last Built: Tue, Aug 6 19:47:27 UTC 2024
pt_pt: Última Modificação: Seg, 8 de Abr de 2024, 18:44:21 UTC Última compilação: Dom, 12 de Mai de 2024, 14:11:43 UTC

source: Legal issues / debian.community domain
pt_pt: Questões legais / Domínio debian.community

source: debian.community domain
pt_pt: Domínio debian.community

source: If you reached this page via a link to debian.community, the page you requested no longer exists.
pt_pt: Se você chegou até esta página através de um link para debian.community, a página solicitada não existe mais.

source: Read on to find out why.
pt_pt: Leia para saber a razão.

source: · Background
pt_pt: · Antecedentes

source: · Previous Statements
pt_pt: · Declarações anteriores

source: · Frequently Asked Questions
pt_pt: · Perguntas frequentes

source: Background
pt_pt: Antecedentes

source: In July 2022 the World Intellectual Property Organization determined that the domain debian.community had been registered in bad faith and was being used to tarnish the trademarks of the Debian Project.
pt_pt: Em julho de 2022 a Organização Mundial da Propriedade intelectual (World Intellectual Property Organization) determinou que o domínio debian.community foi registrado de má fé e estava sendo utilizado para macular as marcas registradas do projeto Debian.

source: It ordered that the domain be handed to the Project.
pt_pt: Ela ordenou que o domínio fosse entregue ao projeto.

source: Previous statements
pt_pt: Declarações anteriores

source: Debian Project: harassment from Daniel Pocock
pt_pt: Projeto Debian: o assédio de Daniel Pocock

source: First published: November 17th, 2021
pt_pt: Publicado primeiramente: 17 de novembro de 2021

source: Debian is aware of a number of public posts made about Debian and its community members on a series of websites by a Mr Daniel Pocock, who purports to be a Debian Developer.
pt_pt: O Debian está ciente de uma série de postagens públicas feitas sobre Debian e sobre os membros da sua comunidade em uma série de sites web pelo Sr. Daniel Pocock, que alega ser um Desenvolvedor Debian.

source: Mr Pocock is not associated with Debian.
pt_pt: O Sr. Pocock não está associado ao Debian.

source: He is neither a Debian Developer, nor a member of the Debian community.
pt_pt: Ele não é um desenvolvedor Debian, nem um membro da comunidade Debian.

source: He was formerly a Debian Developer, but was expelled from the project some years ago for engaging in behaviour which was destructive to Debian's reputation and to the community itself.
pt_pt: Anteriormente ele foi um desenvolvedor Debian, mas foi expulso do projeto há alguns anos por ter um comportamento que era destrutivo para a reputação do Debian e para a própria comunidade.

source: He has not been a member of the Debian Project since 2018.
pt_pt: Ele não é um membro do projeto Debian desde 2018.

source: He is also banned from participating in the Debian community in any form, including through technical contributions, participating in online spaces, or attending conferences and/or events.
pt_pt: Ele também está banido de participar da comunidade Debian de qualquer forma, incluindo através de contribuições técnicas, participando de espaços on-line, ou participando de conferências e/ou eventos.

source: He has no right or standing to represent Debian in any capacity, or to represent himself as a Debian Developer or member of the Debian community.
pt_pt: Ele não tem o direito ou legitimidade para representar o Debian em qualquer condição, ou para se apresentar como um desenvolvedor Debian ou membro da comunidade Debian.

source: In the time since he was expelled from the project, Mr Pocock has engaged in an ongoing and extensive campaign of retaliatory harassment by making a number of inflammatory and defamatory posts online, in particular on a website which purports to be a Debian website.
pt_pt: Desde que foi expulso do projeto, o Sr. Pocock tem se envolvido em uma campanha contínua e extensa de assédio e retaliação, fazendo uma série de postagens on-line inflamatórias e difamatórias, particularmente em um site web que se propõe a ser um site web Debian.

source: The contents of these posts involve not only Debian, but also a number of its Developers and volunteers.
pt_pt: O conteúdo dessas postagens envolve não apenas o Debian, mas também vários de seus(suas) desenvolvedores(as) e voluntários(as).

source: He has also continued to misrepresent himself as being a member of the Debian Community in much of his communication and public presentations.
pt_pt: Ele também continua se apresentando indevidamente como membro da comunidade Debian em grande parte de sua comunicação e apresentações públicas.
